<?php
/**
 * +------------------------------------------------------------------------------
 *错误信息显示类
 * +------------------------------------------------------------------------------
 */
namespace org;

class errorInfo
{
    /**
     * 错误信息
     * 
     * @var array
     */
    private static $data
        = array(
            0    => '操作失败',
            1    => 'ok',
            2    => '用户不存在',
            3    => '操作失败',
            4    => '未登录',
            5    => '删除失败',
	101    => '请求方式有误',
            
            1001 => '参数错误',
            //订单
            2001 => '未检查到改商品',
            2002 => '该商品已下架',
            2003 => '库存不足',
            2004 => '创建订单失败',
            2005 => '未检测到购物车商品信息',
            2006 => '未查找到商品信息',
            2007 => '商品已经下架',
            2008 => '订单已完成或订单不是待收货状态',
            2010 => '余额不足',
            2011 => '积分不足',

            //用户
            3001 => '收货地址最多可添加4条',
	3002 => '请先完善收货地址',

            //评论
            4001 => '7天之内可以评论,评论时间已经过期',
            4002 => '订单未完成或订单不存在',
            4003 => '每个订单只可以评论一次',

            //优惠券
            6001 => '超出领取个数或已领取过了',


        );

    /**
     * 返回错误消息
     * @param int $code 错误代码
     *
     * @return string 错误消息
     */
    public static function getErrMsg($code)
    {

        if (!isset(self::$data[$code])) {
            $code = 0;
        }

        return self::$data[$code];
    }
}

?>
